cyb3rgun/thefirmware/sdkconfig.defaults
# Shared defaults for every thefirmware target.
# Bench boards are Heltec WiFi LoRa 32 V2, which carry an ESP32-D0WDQ6.
CONFIG_IDF_TARGET="esp32"

# Flash. 4 MB is the safe value: Heltec V2 ships with 4 MB and with 8 MB
# depending on the batch, and a 4 MB image flashes on both.
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y

# One application, no OTA, so the application partition is large enough for
# WiFi, ESP-NOW and the OLED together. Changing this needs an erase-flash.
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# The console shares UART0 with the USB protocol link on the Heltec bench,
# so both run at the protocol baud rate of usb-protocol.md section 1.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=921600

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=5120
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
